***PANDAS1***

EJERCICIO 1

Escribí un programa que sume, reste, multiplique y divida dos series de números de Pandas.

In [16]:
import pandas
a=[3, 7, 12, 15, 21]
b= [1, 4, 10, 14, 19]
total=[int(a[x]) + int(b[x]) for x in range(0,len(a))]
total

[4, 11, 22, 29, 40]

In [17]:
import pandas
a=[3, 7, 12, 15, 21]
b= [1, 4, 10, 14, 19]
total= [a[x] - b[x] for x in range(len(a))]
total

[2, 3, 2, 1, 2]

In [18]:
import pandas
a=[3, 7, 12, 15, 21]
b= [1, 4, 10, 14, 19]
total= [a[x] * b[x] for x in range(len(a))]
total

[3, 28, 120, 210, 399]

In [19]:
import pandas
a=[3, 7, 12, 15, 21]
b= [1, 4, 10, 14, 19]
total= [a[x] / b[x] for x in range(len(a))]
total

[3.0, 1.75, 1.2, 1.0714285714285714, 1.105263157894737]

EJERCICIO 2

Realizá un programa que compare (si son mayores, menores o iguales) los elementos de dos series de números de Pandas.

In [38]:
import pandas
c=[3, 7, 9, 14, 25]
d= [1, 7, 10, 16, 19]
for x in range(len(c)):
    if c[x] > d[x]:
        print("MAYOR")
    elif c[x] < d[x]:
        print("Menor")
    elif c[x] == d[x]:
        print("Igual")
    else:
        "No se puede"

MAYOR
Igual
Menor
Menor
MAYOR

EJERCICIO 3

Escribí un programa para convertir un diccionario a una serie de Pandas.

In [39]:
import pandas as pd
dict1 = {"a": 10, "b": 20, "c": 30, "d": 40, "e": 50}
pd.Series(dict1)

a    10
b    20
c    30
d    40
e    50
dtype: int64

EJERCICIO 4

Escribí un programa que dado un diccionario cuyos valores son listas de números, cree otro diccionario con las mismas claves, pero donde los valores sean una lista de números donde se potencia un número por el siguiente, tomándolos de a pares. Para ser más claros miremos este ejemplo donde si un diccionario es:

In [48]:
import pandas as pd
dict1 = {"a": [1,3,5,2], "b": [4,2,3,3]}
for value in range(len(dict1["a"])):
    dict1["a"][0] ^ dict1["a"][1]
for value1 in range(len(dict1["b"])):
    dict1["b"][0]^ dict1['b'][1]

EJERCICIO 5

Realizá un programa para crear y mostrar un DataFrame a partir de un diccionario y de unas etiquetas (o labels).

In [50]:
import pandas as pd
datos_ejemplo = {"nombre": ["Agustina", "Diana", "Karen", "Julián", "Emilio", "Miguel", "Mateo", "Laura", "Jorge", "Lucas"], "puntaje": [12.5, 9, 16.5, 13, 9, 20, 14.5, 10, 8, 19], "intentos": [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], "califica": [1, 0, 1, 0, 0, 1, 1, 0, 0, 1]}

labels = ["a", "b", "c", "d", "e", "f", "g", "h", "i", "j"]

DF=pd.DataFrame(datos_ejemplo, index=labels)
DF

     nombre  puntaje  intentos  califica
a  Agustina     12.5         1         1
b     Diana      9.0         3         0
c     Karen     16.5         2         1
d    Julián     13.0         3         0
e    Emilio      9.0         2         0
f    Miguel     20.0         3         1
g     Mateo     14.5         1         1
h     Laura     10.0         1         0
i     Jorge      8.0         2         0
j     Lucas     19.0         1         1

EJERCICIO 6

Escribí un programa que muestre un resumen de la información básica de un DataFrame y sus datos.

In [53]:
DF.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   nombre    10 non-null     object
 1   puntaje   10 non-null     float64
 2   intentos  10 non-null     int64
 3   califica  10 non-null     int64
dtypes: float64(1), int64(2), object(1)
memory usage: 400.0+ bytes

EJERCICIO 7

Escribí un programa que obtenga las 3 primeras filas de un DataFrame dado.

In [54]:
DF.head(3)

     nombre  puntaje  intentos  califica
a  Agustina     12.5         1         1
b     Diana      9.0         3         0
c     Karen     16.5         2         1

EJERCICIO 8

Realizá un programa que seleccione e impirma las columnas "nombre" y "puntaje" del DataFrama anterior.

In [61]:
DF[["nombre", "puntaje"]]

     nombre  puntaje
a  Agustina     12.5
b     Diana      9.0
c     Karen     16.5
d    Julián     13.0
e    Emilio      9.0
f    Miguel     20.0
g     Mateo     14.5
h     Laura     10.0
i     Jorge      8.0
j     Lucas     19.0

EJERCICIO 9

Escribí un programa que dado el DataFrame anterior imprima los nombres en mayúscula y la longitud de los mismos en una nueva tabla

In [79]:
df=pd.DataFrame(columns=["Nombre", "Largo"])
nombre1=[]
largo=[]
for nombre in DF["nombre"]:
    nombre1.append(str.upper(nombre))
    largo.append(len(nombre))
df["Nombre"]=nombre1
df["Largo"]=largo
df

     Nombre  Largo
0  AGUSTINA      8
1     DIANA      5
2     KAREN      5
3    JULIÁN      6
4    EMILIO      6
5    MIGUEL      6
6     MATEO      5
7     LAURA      5
8     JORGE      5
9     LUCAS      5

***PANDAS2***

EJERCICIO 1

Escribí un programa que dado un diccionario cuyos valores sean listas de números cree un DataFrame y luego seleccione e imprima las filas del DataFrame basado en un valor de una columna.

In [85]:
dic = {1: [1, 4, 3, 4, 5], 2: [4, 5, 6, 7, 8], 3: [7, 8, 9, 0, 1]}
df1=pd.DataFrame(dic)
df1.iloc[4,0]

5

EJERCICIO 2

Escribí un programa que guarde en una lista una columna de un DataFrame.

In [87]:
LISTA=[]
LISTA.append(df1[1])
LISTA

[0    1
 1    4
 2    3
 3    4
 4    5
 Name: 1, dtype: int64]

EJERCICIO 3

Realizá un programa que agregue datos a un DataFrame vacío.

In [93]:
df2=pd.DataFrame()
df2["columna"]=["data"]
df2

  columna
0    data

EJERCICIO 4

Escribí un programa que elimine las primeras n filas de un DataFrame. Pista: el DataFrame original no debe modificarse.

In [98]:
def eliminarfilas(n):
    dfdrop = df.drop(range(n))
    print(dfdrop)

eliminarfilas(1)

   Nombre  Largo
1   DIANA      5
2   KAREN      5
3  JULIÁN      6
4  EMILIO      6
5  MIGUEL      6
6   MATEO      5
7   LAURA      5
8   JORGE      5
9   LUCAS      5

EJERCICIO 5

Realizá un programa que verifique si una columna dada se encuentra presente en un DataFrame.

In [104]:
def columna(nombrecolumna):
    print(nombrecolumna in df.columns)

columna("Lago")

False

EJERCICIO 6

Escribí un programa que dado dos diccionarios genere dos DataFrame y los una tanto en el eje de las columnas como en el eje de las filas.

In [119]:
datos_ejemplo1={"nombre": ["Agustina", "Diana", "Karen", "Julián", "Emilio", "Miguel", "Mateo", "Laura", "Jorge", "Lucas"], "Sexo": ["F", "F", "F", "M", "M", "M", "M", "F", "M", "M"], "Edad": [1,2,3,4,5,6,7,8,9,10]}
datos_ejemplo
def dicendf(dic1,dic2):
    m=pd.DataFrame(dic1)
    y=pd.DataFrame(dic2)
    z=pd.merge(m,y)
    print(z)

dicendf(datos_ejemplo1, datos_ejemplo)

     nombre Sexo  Edad  puntaje  intentos  califica
0  Agustina    F     1     12.5         1         1
1     Diana    F     2      9.0         3         0
2     Karen    F     3     16.5         2         1
3    Julián    M     4     13.0         3         0
4    Emilio    M     5      9.0         2         0
5    Miguel    M     6     20.0         3         1
6     Mateo    M     7     14.5         1         1
7     Laura    F     8     10.0         1         0
8     Jorge    M     9      8.0         2         0
9     Lucas    M    10     19.0         1         1

EJERCICIO 7

Creá un programa que dado un diccionario y una lista añada está última al DataFrame generado a partir del diccionario.

In [111]:
lista=[1,2,3,4,5,6,7,8,9,10]
def agregarlista(dic1, lista1):
    t=pd.DataFrame(dic1)
    t["Columna_lista"]= lista1
    print(t)

agregarlista(datos_ejemplo1, lista )

     nombre Sexo  Columna_lista
0  Agustina    F              1
1     Diana    F              2
2     Karen    F              3
3    Julián    M              4
4    Emilio    M              5
5    Miguel    M              6
6     Mateo    M              7
7     Laura    F              8
8     Jorge    M              9
9     Lucas    M             10

EJERCICIO 8

Realizá un programa que dado dos DataFrames genere otro que contenga solo las columnas en común.

In [121]:
datos_ejemplo11=datos_ejemplo
datos_ejemplo11["Edad"]=[1,2,3,4,5,6,7,8,9,10]
df11= pd.DataFrame(datos_ejemplo11)
df111= pd.DataFrame(datos_ejemplo1) 
df11

     nombre  puntaje  intentos  califica  Edad
0  Agustina     12.5         1         1     1
1     Diana      9.0         3         0     2
2     Karen     16.5         2         1     3
3    Julián     13.0         3         0     4
4    Emilio      9.0         2         0     5
5    Miguel     20.0         3         1     6
6     Mateo     14.5         1         1     7
7     Laura     10.0         1         0     8
8     Jorge      8.0         2         0     9
9     Lucas     19.0         1         1    10

In [122]:
def unirdf(df1, df2):
    df3=pd.concat([df1, df2], join= "inner" )
    print(df3)
unirdf(df11, df111)

     nombre  Edad
0  Agustina     1
1     Diana     2
2     Karen     3
3    Julián     4
4    Emilio     5
5    Miguel     6
6     Mateo     7
7     Laura     8
8     Jorge     9
9     Lucas    10
0  Agustina     1
1     Diana     2
2     Karen     3
3    Julián     4
4    Emilio     5
5    Miguel     6
6     Mateo     7
7     Laura     8
8     Jorge     9
9     Lucas    10